title: DeviceLogonEvents
description: Login and other authentication events
platform: windows
log_source: windowsdefenderatp
event_code: DeviceLogonEvents
event_version: '0'
event_fields:
- standard_name: event_date_creation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: device_id
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: computer_name
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: action_type
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: user_domain
  standard_type: TBD
  name: AccountDomain
  type: string
  description: Domain of the account
  sample_value: ''
- standard_name: user_name
  standard_type: TBD
  name: AccountName
  type: string
  description: User name of the account
  sample_value: ''
- standard_name: user_sid
  standard_type: TBD
  name: AccountSid
  type: string
  description: Security Identifier (SID) of the account
  sample_value: ''
- standard_name: logon_type
  standard_type: TBD
  name: LogonType
  type: string
  description: Type of logon session
  sample_value: ''
- standard_name: logon_id
  standard_type: TBD
  name: LogonId
  type: string
  description: Identifier for a logon session. This identifier is unique on the same
    machine only between restarts.
  sample_value: ''
- standard_name: dst_host_name
  standard_type: TBD
  name: RemoteDeviceName
  type: string
  description: Name of the machine that performed a remote operation on the affected
    machine. Depending on the event being reported, this name could be a fully-qualified
    domain name (FQDN), a NetBIOS name, or a host name without domain information.
  sample_value: ''
- standard_name: dst_ip_addr
  standard_type: TBD
  name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- standard_name: remote_ip_type
  standard_type: TBD
  name: RemoteIPType
  type: string
  description: Type of IP address, for example Public, Private, Reserved, Loopback,
    Teredo, FourToSixMapping, and Broadcast
  sample_value: ''
- standard_name: dst_port
  standard_type: TBD
  name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- standard_name: additional_fields
  standard_type: TBD
  name: AdditionalFields
  type: string
  description: Additional information about the event in JSON array format
  sample_value: ''
- standard_name: process_user_domain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: process_user_name
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: process_user_sid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible
    for the event
  sample_value: ''
- standard_name: process_integrity_level
  standard_type: TBD
  name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns
    integrity levels to processes based on certain characteristics, such as if they
    were launched from an internet download. These integrity levels influence permissions
    to resources.
  sample_value: ''
- standard_name: process_token_elevation
  standard_type: TBD
  name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control
    (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: process_hash_sha1
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_hash_md5
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_name
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: process_id
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: process_command_line
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: process_creation_time
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: process_path
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_parent_id
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible
    for the event
  sample_value: ''
- standard_name: process_parent_name
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for
    the event
  sample_value: ''
- standard_name: process_parent_creation_time
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event
    was started
  sample_value: ''
- standard_name: report_id
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events,
    this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- standard_name: app_guard_container_id
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard
    to isolate browser activity
  sample_value: ''
- standard_name: user_local_admin
  standard_type: TBD
  name: IsLocalAdmin
  type: boolean
  description: Boolean indicator of whether the user is a local administrator on the device
  sample_value: ''
references: []
tags: []
