title: DeviceNetworkEvents
description: Network connection and related events
platform: windows
log_source: windowsdefenderatp
event_code: DeviceNetworkEvents
event_version: '0'
event_fields:
- standard_name: event_date_creation
  standard_type: TBD
  name: Timestamp
  type: date
  description: Date and time when the event was recorded
  sample_value: ''
- standard_name: machine_id
  standard_type: TBD
  name: DeviceId
  type: string
  description: Unique identifier for the machine in the service
  sample_value: ''
- standard_name: computer_name
  standard_type: TBD
  name: DeviceName
  type: string
  description: Fully qualified domain name (FQDN) of the machine
  sample_value: ''
- standard_name: action_type
  standard_type: TBD
  name: ActionType
  type: string
  description: Type of activity that triggered the event
  sample_value: ''
- standard_name: dst_ip_addr
  standard_type: TBD
  name: RemoteIP
  type: string
  description: IP address that was being connected to
  sample_value: ''
- standard_name: dst_port
  standard_type: TBD
  name: RemotePort
  type: int
  description: TCP port on the remote device that was being connected to
  sample_value: ''
- standard_name: dst_host_name
  standard_type: TBD
  name: RemoteUrl
  type: string
  description: URL or fully qualified domain name (FQDN) that was being connected
    to
  sample_value: ''
- standard_name: src_ip_addr
  standard_type: TBD
  name: LocalIP
  type: string
  description: IP address assigned to the local machine used during communication
  sample_value: ''
- standard_name: src_port
  standard_type: TBD
  name: LocalPort
  type: int
  description: TCP port on the local machine used during communication
  sample_value: ''
- standard_name: network_protocol
  standard_type: TBD
  name: Protocol
  type: string
  description: IP protocol used, whether TCP or UDP
  sample_value: ''
- standard_name: src_ip_addr_type
  standard_type: TBD
  name: LocalIPType
  type: string
  description: Type of IP address, for example Public, Private, Reserved, Loopback,
    Teredo, FourToSixMapping, and Broadcast
  sample_value: ''
- standard_name: dst_ip_addr_type
  standard_type: TBD
  name: RemoteIPType
  type: string
  description: Type of IP address, for example Public, Private, Reserved, Loopback,
    Teredo, FourToSixMapping, and Broadcast
  sample_value: ''
- standard_name: hash_sha1
  standard_type: TBD
  name: InitiatingProcessSHA1
  type: string
  description: SHA-1 of the process (image file) that initiated the event
  sample_value: ''
- standard_name: hash_md5
  standard_type: TBD
  name: InitiatingProcessMD5
  type: string
  description: MD5 hash of the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_name
  standard_type: TBD
  name: InitiatingProcessFileName
  type: string
  description: Name of the process that initiated the event
  sample_value: ''
- standard_name: process_id
  standard_type: TBD
  name: InitiatingProcessId
  type: int
  description: Process ID (PID) of the process that initiated the event
  sample_value: ''
- standard_name: process_command_line
  standard_type: TBD
  name: InitiatingProcessCommandLine
  type: string
  description: Command line used to run the process that initiated the event
  sample_value: ''
- standard_name: process_creation_time
  standard_type: TBD
  name: InitiatingProcessCreationTime
  type: date
  description: Date and time when the process that initiated the event was started
  sample_value: ''
- standard_name: process_path
  standard_type: TBD
  name: InitiatingProcessFolderPath
  type: string
  description: Folder containing the process (image file) that initiated the event
  sample_value: ''
- standard_name: process_parent_name
  standard_type: TBD
  name: InitiatingProcessParentFileName
  type: string
  description: Name of the parent process that spawned the process responsible for
    the event
  sample_value: ''
- standard_name: process_parent_id
  standard_type: TBD
  name: InitiatingProcessParentId
  type: int
  description: Process ID (PID) of the parent process that spawned the process responsible
    for the event
  sample_value: ''
- standard_name: process_parent_creation_time
  standard_type: TBD
  name: InitiatingProcessParentCreationTime
  type: date
  description: Date and time when the parent of the process responsible for the event
    was started
  sample_value: ''
- standard_name: user_domain
  standard_type: TBD
  name: InitiatingProcessAccountDomain
  type: string
  description: Domain of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: user_name
  standard_type: TBD
  name: InitiatingProcessAccountName
  type: string
  description: User name of the account that ran the process responsible for the event
  sample_value: ''
- standard_name: user_sid
  standard_type: TBD
  name: InitiatingProcessAccountSid
  type: string
  description: Security Identifier (SID) of the account that ran the process responsible
    for the event
  sample_value: ''
- standard_name: process_integrity_level
  standard_type: TBD
  name: InitiatingProcessIntegrityLevel
  type: string
  description: Integrity level of the process that initiated the event. Windows assigns
    integrity levels to processes based on certain characteristics, such as if they
    were launched from an internet download. These integrity levels influence permissions
    to resources.
  sample_value: ''
- standard_name: process_token_elevation
  standard_type: TBD
  name: InitiatingProcessTokenElevation
  type: string
  description: Token type indicating the presence or absence of User Access Control
    (UAC) privilege elevation applied to the process that initiated the event
  sample_value: ''
- standard_name: report_id
  standard_type: TBD
  name: ReportId
  type: long
  description: Event identifier based on a repeating counter. To identify unique events,
    this column must be used in conjunction with the ComputerName and EventTime columns.
  sample_value: ''
- standard_name: app_guard_container_id
  standard_type: TBD
  name: AppGuardContainerId
  type: string
  description: Identifier for the virtualized container used by Application Guard
    to isolate browser activity
  sample_value: ''
references: []
tags: []
